<?php
// Heading
$_['heading_title']     		= 'Модификации';

// Text
$_['text_success']          	= 'Модификации успешно обновлены!';
$_['text_list']          		= 'Список модификаций';
$_['text_add']          		= 'Добавление модификации';
$_['text_edit']          		= 'Редактирование модификации';

// Column
$_['column_group']          	= 'Группа модификаций';
$_['column_sort_order']         = 'Порядок сортировки';
$_['column_action']          	= 'Действие';

// Entry
$_['entry_group']          		= 'Название группы:';
$_['entry_name']          		= 'Название модификации:';
$_['entry_sort_order']          = 'Порядок сортировки:';

// Error
$_['error_permission']          = 'У вас нет прав для изменения модификации!';
$_['error_group']          		= 'Название группы модификаций должно быть от 1 до 64 символов!';
$_['error_name']          		= 'Название модификации должно быть от 1 до 64 символов!';
