<?php
  // Color for QR
  $color_qr = [
    11874=> array('Audi','69,179,238'),
    11875=> array('BMW','255,37,37'),
    11876=> array('Opel','140,255,97'),
    11877=> array('Renault','255,254,3'),
    11878=> array('Citroen','255,254,3'),
    11881=> array('Chrysler','52,89,228'),
    11883=> array('Volvo','158,82,177'),
    11886=> array('Peugeot','255,254,3'),
    11889=> array('Ford',''),
    11894=> array('Mercedes','80,52,38'),
    11897=> array('Seat','69,179,238'),
    11905=> array('Volkswagen','69,179,238'),
    11911=> array('Lancia','193,165,213'),
    11913=> array('Mazda','48,213,200'),
    11920=> array('Alfa Romeo','193,165,213'),
    11923=> array('Suzuki','48,213,200'),
    11925=> array('Hyundai','48,213,200'),
    11937=> array('Jeep','52,89,228'),
    11939=> array('Fiat','193,165,213'),
    11948=> array('Nissan','48,213,200'),
    11952=> array('Mitsubishi','48,213,200'),
    11958=> array('Dodge','52,89,228'),
    11976=> array('Toyota','48,213,200'),
    11980=> array('Rover',''),
    11982=> array('Land-Rover','255,37,37'),
    11986=> array('SsangYong','48,213,200'),
    11995=> array('Iveco','193,165,213'),
    12005=> array('Honda','48,213,200'),
    12025=> array('Skoda','69,179,238'),
    12103=> array('Kia','48,213,200'),
    12107=> array('Saab','140,255,97'),
    12111=> array('Chevrolet','52,89,228'),
    12113=> array('Dacia','255,254,3'),
    12141=> array('Isuzu','48,213,200'),
    12169=> array('Lada',''),
    12183=> array('Mini','255,37,37'),
    12187=> array('Daewoo','48,213,200'),
    12213=> array('Subaru','48,213,200'),
    12229=> array('Daihatsu','48,213,200'),
    12249=> array('Smart','80,52,38'),
    12266=> array('Lexus','48,213,200'),
    12294=> array('Acura','48,213,200'),
    12347=> array('Bentley','69,179,238'),
    12413=> array('Buick','52,89,228'),
    12431=> array('Cadillac','52,89,228'),
    12447=> array('Chery',''),
    12550=> array('DAF',''),
    12571=> array('Datsun','48,213,200'),
    12592=> array('DongFeng','48,213,200'),
    12595=> array('Ferrari','193,165,213'),
    12636=> array('Geely',''),
    12646=> array('Genesis','48,213,200'),
    12650=> array('GMC',''),
    12663=> array('Great-Wall','48,213,200'),
    12735=> array('Hummer',''),
    12765=> array('Infiniti','48,213,200'),
    12787=> array('Iran-Khodro','48,213,200'),
    12800=> array('Jaguar','255,37,37'),
    12920=> array('LDV',''),
    12936=> array('Lifan','48,213,200'),
    12945=> array('Lincoln',''),
    12957=> array('MAN','69,179,238'),
    12976=> array('Maserati','193,165,213'),
    13091=> array('Mercury',''),
    13105=> array('MG',''),
    13141=> array('Neoplan','80,52,38'),
    13211=> array('Plymouth',''),
    13221=> array('Pontiac',''),
    13231=> array('Porsche','69,179,238'),
    13239=> array('Proton','48,213,200'),
    13246=> array('Ravon','48,213,200'),
    13278=> array('Rolls-Royce','255,254,3'),
    13304=> array('Scania','69,179,238'),
    13317=> array('Scion','48,213,200'),
    13329=> array('Setra','80,52,38'),
    13398=> array('Tata','48,213,200'),
    13404=> array('Tesla',''),
    13518=> array('Zotye','48,213,200'),
    13532=> array('ЗАЗ',''),
    13540=> array('Газ','')
  ];
?>
<?php 
  // Диаметр R
  $location_array = [
    "R12",
    "R12C",
    "R13",
    "R13C",
    "R14",
    "R14C",
    "R15",
    "R15C",
    "R16",
    "R16.5",
    "R16C",
    "R17",
    "R17.5",
    "R17C",
    "R18",
    "R19",
    "R19.5",
    "R20",
    "R21",
    "R22",
    "R22.5",
    "R23",
    "R24",
    "R24.5",
    "R25"
  ];
?>

<?php 
  // Диаметр J
  $width_array = [
    "5",
    "5.5",
    "6",
    "6.5",
    "7",
    "7.5",
    "8",
    "8.5",
    "9",
    "9.5",
    "10",
    "10.5",
    "11",
    "11.5",
    "12",
    "12.5"
  ];
?>

<?php 
  // Кол-во отверстий
  $height_array = [
    "3",
    "4",
    "5",
    "6",
    "10"
  ];
?>

<?php 
  // Расстояние между отверстиями PCD, мм
  $weight_array = [
    "98",
    "100",
    "105",
    "108",
    "110",
    "112",
    "114.3",
    "115",
    "118",
    "120",
    "120.7",
    "127",
    "130",
    "139.7",
    "150",
    "160",
    "161",
    "165.1",
    "170",
    "180",
    "205"
  ];
?>

<?php 
  // Диаметр центрального отверстия DIA, мм
  $diadiametr_array = [
    "52.1",
    "54.1",
    "56.1",
    "56.6",
    "57.1",
    "58.1",
    "59.1",
    "59.6",
    "60.1",
    "63.4",
    "64.1",
    "65.1",
    "66.1",
    "66.6",
    "67.1",
    "70.1",
    "71.2",
    "72.6",
    "74.1"
  ];
?>


<?php /* Тип двигателя */ ?>
<?php $mpn_array = [
  ["FSI", "бензин"],
  ["GDi", "бензин"],
  ["HPi", "бензин"],
  ["i", "бензин"],
  ["IDE", "бензин"],
  ["JTS", "бензин"],
  ["Kompr", "бензин"],
  ["MPI", "бензин"],
  ["TCE", "бензин"],
  ["TFSI", "бензин"],
  ["THP", "бензин"],
  ["Ti", "бензин"],
  ["TSI", "бензин"],
  ["VTEC", "бензин"],
  ["VTI", "бензин"],
  ["VVT-i", "бензин"], 
  ["карб", "бензин"],
  ["моно", "бензин"],
  ["CDi", "дизель"],
  ["CDT", "дизель"],
  ["CDTi", "дизель"],
  ["CRD", "дизель"],
  ["CRDi", "дизель"],
  ["cTDi", "дизель"],
  ["D", "дизель"],
  ["D-4D", "дизель"],
  ["D-CAT", "дизель"],
  ["D5", "дизель"],
  ["DCi", "дизель"],
  ["DDiS", "дизель"],
  ["Di", "дизель"],
  ["DiD", "дизель"],
  ["DT", "дизель"],
  ["DTH", "дизель"],
  ["DTi", "дизель"],
  ["DTL", "дизель"],
  ["HDi", "дизель"],
  ["HPI", "дизель"],
  ["HPT", "дизель"],
  ["i-CTDi", "дизель"],
  ["i-DTEC", "дизель"],
  ["JTD", "дизель"],
  ["SDi", "дизель"],
  ["TD", "дизель"],
  ["TDCi", "дизель"],
  ["TDDi", "дизель"],
  ["TDi", "дизель"],
  ["TDi PD", "дизель"],
  ["TDS", "дизель"],
  ["TiD", "дизель"],
  ["VCDi", "дизель"],
  ["XDI", "дизель"],
  ["", "электро"]
]; ?>

<?php /* Коробка */ ?>
<?php $upc_array = ["АКПП","МКПП","Робот","Вариатор"]; ?>

<?php /* Тип кузова */ ?>
<?php $ean_array = ["седан","хэтчбек","универсал","купе","кабриолет","минивэн","пикап","фургон","тягач","лифтбек","внедорожник"]; ?>
